Revit 2027 API
ElectricalSystem.SystemType Property
 The Electrical System Type of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalSystemType SystemType { get; }
Public ReadOnly Property SystemType As ElectricalSystemType
	Get
public:
property ElectricalSystemType SystemType {
	ElectricalSystemType get ();
}
member SystemType : ElectricalSystemType with get
Property Value
ElectricalSystemType
Remarks
 This property is used to retrieve the Electrical System Type of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace